<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionSeeder extends Seeder
{
    public function run(): void
    {
        $permissions = [
            // المنتجات
            'عرض المنتجات', 'إضافة المنتجات', 'تعديل المنتجات', 'حذف المنتجات',

            // المشتريات
            'عرض المشتريات', 'إضافة المشتريات', 'تعديل المشتريات', 'حذف المشتريات',

            // الفواتير
            'عرض الفواتير', 'إضافة الفواتير', 'تعديل الفواتير', 'حذف الفواتير',

            // الموظفين
            'عرض الموظفين', 'إضافة الموظفين', 'تعديل الموظفين', 'حذف الموظفين',

            // الرواتب والسلف والمدفوعات
            'عرض الرواتب', 'إضافة الرواتب',
            'عرض السلف', 'إضافة السلف',
            'عرض المدفوعات', 'إضافة المدفوعات',

            // الأقسام
            'عرض الأقسام', 'إضافة الأقسام',

            // الجرد والمخزون
            'عرض الجرد', 'إضافة الجرد',
            'عرض المخزون', 'عرض تقارير المخزون',
            'اضافه مخزون',
            'عرض سجل المخزون',
            'عرض الجرد الحالي',
            'عرض الجرد الشهري',
            'عرض الجرد السنوي',

            // المبيعات
            'عرض المبيعات',
            'اضافه مبيعات',

            // المرتجعات
            'عرض مرتجع الشراء', 'إضافة مرتجع الشراء',
            'عرض مرتجع البيع', 'إضافة مرتجع البيع',

            // الإعدادات
            'إدارة الصلاحيات',

            // قائمة الفواتير
            'عرض قائمة الفواتير',
        ];

        foreach ($permissions as $permission) {
            Permission::firstOrCreate(['name' => $permission, 'guard_name' => 'employee']);
        }

        echo "✅ تم إنشاء جميع الصلاحيات بنجاح.\n";
    }
}
